import 'package:flutter/material.dart';
import 'package:index/screens/3infant1.dart';
import 'package:index/screens/3trimester.dart';
import 'package:index/screens/dashboard.dart';

void main() {
  runApp(MyApp());
}

class MyApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: 'የሁለተኛው ሦስት ጊዜ',
      theme: ThemeData(
        primarySwatch: Colors.blue,
      ),
      home: Trimester2Page(),
    );
  }
}

class Trimester2Page extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('ትሪሚስተር 2',
         style: TextStyle(
                     fontFamily: 'Abyssinica SIL',
                    ),),
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            ExpansionTile(
              title: Text(
                'የአራተኛው ወር የእርግዝና ጊዜ ',
                style: TextStyle(
                    color: Colors.purple[600],
                    fontWeight: FontWeight.bold,
                    fontFamily: 'Abyssinica SIL',
                    fontSize: 18.0),
              ),
              children: [
                SingleChildScrollView(
                  child: Padding(
                    padding: EdgeInsets.all(16.0),
                    child: Column(
                      crossAxisAlignment: CrossAxisAlignment.start,
                      children: [
                        Text(
                          'ይህ ወር ምቹ የሚባለው ወር ስለሆነ ለራስሽ ጊዜ በመስጠት ዘና ለማለትና እርግዝናሽን ለማጣጣም ሞክሪ። አካላትሽ ላይ የሚኖሩት ለውጦች (ጡትሽ ዳሌሽ መቀመጫሽ) ውበትን ስለሚያጎናፅፉ ጥሩ ስሜት እንዲሰማሽ ያረግሻል። አብዛኛው ነብሰ ጡሮች ፊታቸው ጥርት የማለትና የማብራት ስሜት ሲያሳዩ የተወሰኑ ነብሰ ጡሮች ላይ ግን የመትቆርና ነጠብጣብ ወይም ማዲአት ማውጣት ይታያል። ጥቁረቱም ይሁን ማዲአቱ በጊዜ የሚለቁ ናቸው። ዘጠኝ ወር ሙሉ ከሚያማችው ነብሰ ጡሮች መካከል ካልሆንሽ በስተቀር በዚህ ወር ማቅለሽለሽና ድካም የሚባሉት ምልክቶች ይቀንሳሉ ወይም ይጠፋሉ። የሆድ ድርቀቱ ግን ሊከፋ ስለሚችል እንቅስቃሴ ማድረግ፤ ብዙ ውሃ መጠጣት፤ ፍራፍሬና ቅጠላ ቅጠል መብላት አትዘንጊ ቀለል ያረግልሻል። የአፍንጫ መዘጋትና መድማት በዚህ ወር ሊከሰቱ ከሚችሉ የእርግዝና ጣጣዎች ውስጥ ዋነኞቹ ናቸው። በጣም ካስቸገረሽ ሀኪምሽን አማክሪ።  \n\n'
                          'ቃሩም እየባሰ ስለሚመጣ ማቅለያ መንገዶችን መተግበር አትርሺ። የብልት ፈሳሽሽ ሊጨምር ይችላል የተለመደ ነው። ሰፋፊ ልብስ የምትለብሺ ከሆነ እስከ 6 ወር መግቢያሽ ሰው ላያቅብሽ ቢችልም በዚህ ወር መጨረሻ ላይ ላንቺ የሆድሽ መጠን መተለቁ በደንብ ይታወቅሻል። ታድያ ሆድሽ እየገፋ ሲመጣ በጎንሽ መተኛት ይኖርብሻል – በተለይ በግራ ጎንሽ። በጎን መተኛት የደም ዝውውርሽንበማፋጠን ለልጅሽ አስፈላጊ ነገሮች በበቂ ሁኔታ እንዲደርስ ያደርጋል። የሆድሽ መግፋት ሚዛንሽን ስለሚያዛባው ታኮ ጫማ ባታረጊና እንቅስቃሴ ስታደርጊ ጥንቃቄ በተሞላበት መንገድ ቢሆን ይመከራል። በቅድመ ወሊድ ክትትልሽ ወቅት የስኳር መጠንሽ ይለካል። ስኳር ካለብሽ በተቀረው የእርግዝና ጊዜሽ የአመጋገብ ባህልሽን በደንብ ማስተካከል ይኖርብሻል።\n\n'
                          'ሌላ ልብ ልትይው የሚገባሽ ክብደትሽን ነው። በእርግዝና ሰአት ልትጨምሪው የሚገባ የክብደት መጠን አለ። ይህ የክብደት መጠን እርግዝናው ሲጀመር በነበረሽ ክብደት ሲወሰን ከማርገዟ በፊት ክብደቷ መካከለኛ የነበረች አንድ ነብሰ ጡር ከ11 እስከ 16 ኪሎ መጨወር ይኖርባታል። የመጀመርያ ሶስት ወራቶች ላይ ክብደትሽ እስከ 2 ኪሎ ብቻ ሲጨምር በተቀሩት ወራቶች ግን በየሳምንቱ ወደ ግማሽ ኪሎ ገደማ ትጨምሪያለሽ። በእርግዝና ወቅት ከመጠን በላይ መወፈርም መክሳትም የራሱ የሆነ ጉዳት ስላለው በጣም እየወፈርሽ ወይም እየከሳሽ ከሆነ ወይም እርግዝናውን ስትጀምሪ በጣም ቀጭን ወይም ወፍራም ከነበርሽ ሀኪምሽን አማክሪ። የአመጋገብና እንቅስቃሴ የማድረግ ባህልሽን እንደ ክብደትሽ መጠን እንድታስተካክዪ ይደረጋል። ምንም እንኳን ብዙ ወራት ቢቀርሽም ለልጅሽ የሚሆኑ አንዳንድ ነገሮችን ማዘጋጀት ሊያስደስትሽ ይችላል ለምሳሌ ልብስ መግዛት፤ የቤት እቃ አቀማመጥሽን መቀያየር፤ የሚተኛበትን ክፍል ወይም ቦታ ማዘጋጀት። ይህን ማድረግ ክፋት ባይኖረውም ከአቅምሽ በላይ የሆኑ ስራዎችን መስራት ልጅሽን ሊጎዳ ብሎም ውርጃን ሊያስከትል ስለሚችል ጥንቃቄ ማረግ ይኖርብሻል።\n\n'
                          'ስለ ፅንሱ\n\n'
                          'ከባለፈው ከሌላው ሰውነቷ ጭንቅላቷ አሁንም በአንፃሩ ትልቅ ቢሆንም ቅንድብና ሽፋሽፍት በማብቀል ስትወለድ ወደሚኖራት መልክ ትጠጋለች። ከጭንቅላቷ ውጪ ያሉ አካላቶቿም በፍጥነት ያድጋሉ። አንገቷ ስለሚያድግም ጭንቅላቷ ከሰውነቷ ተለይቶ አንገቷ ላይ ይቀመጣል። እንደ ማዛጋት፣ መዋጥና እጅ መጥባት የመሳሰሉ እንቅስቃሴዎችን ታደርጋለች። የልብ ምቷም ስለሚጠነክር በልብ ማዳመጫ መደመጥ ይችላል። \n\n'
                          'እጇ ከሰውነቷ ጋር የተስተካከለ ቁመት ሲኖረው እግሯ በፍጥነት በማደግ ከአጇ በቁመት ይበልጣል። ሰውነቷ ጸጉር ያበቅላል – መወለጃዋ ሲቃረብ የሚረግፍ ፀጉር ነው። ጉበቷ ቅባት ለመፍጨት የሚያገለግለዉን የጉበት ፈሳሽ (ባይል) ጣፍያዋ ደሞ ቀይ የደም ህዋሶችን ያመርታል። እጅና እግሯ በፍጥነት በማደጉና አጥንቶቿ በመጠንከራቸው በደንብ ትንቀሳቀሳለች። አንዳንድ ነብሰ ጡሮች ፅንሱ ሲንቀሳቀስ የእርግብግቢት አይነት ስሜት ይሰማቸዋል። ሰውነቷ እያደገ በመጣ ቁጥር ታዲያ እትብቷም እየረዘመና እየወፈረ ይመጣል። \n\n'
                          'በወሩ መጨረሻ \n'
                          'ከ140 እስከ 150 ግራም ትመዝናለች \n'
                          '13 ሴንቲ ሜተር ትረዝማለች \n'
                          'በአይን ብትታይ ቀይስር ታክላለች',
                          style: TextStyle(
                              color: Colors.black,
                              
                              fontFamily: 'Abyssinica SIL',
                              fontSize: 16.0),
                        ),
                      ],
                    ),
                  ),
                ),
              ],
            ),

            ExpansionTile(
              title: Text(
                'የአምስተኛው ወር የእርግዝና ጊዜ  ',
                style: TextStyle(
                    color: Colors.purple[600],
                    fontWeight: FontWeight.bold,
                    fontFamily: 'Abyssinica SIL',
                    fontSize: 18.0),
              ),
              children: [
                SingleChildScrollView(
                  child: Padding(
                    padding: EdgeInsets.all(16.0),
                    child: Column(
                      crossAxisAlignment: CrossAxisAlignment.start,
                      children: [
                        Text(
                          'ልጅሽን ፆታ ለማወቅ ጓግተሽ ከሆነ ይህ ወር ደስ የምትሰኝበት ጊዜ ነው። አዎ የልጅሽ ፆታ ከ 20ኛው ሳምንት ጀምሮ ምስlu በአልትራሳውንድ መታየት ይጀምራል። ታድያ የልጅሽን ፆታ ማወቅሽ ስለስሙ፣ ስለምትገዥለት ልብስ፣ ስለምታጫውችው ጨዋታ እያሰብሽ ዘና እንድትይ ያረግሻል። በተጨማሪም እንቅስቃሴው በደንብ ይታወቅሻል። ለመጀመርያ ጊዜ የልጅሽን እንቅስቃሴ መስማት ወደር የሌለው ደስታን ሲሰጥ እስክትለምጂው ድረስ በተንቀሳቀሰ ቁጥር ብርቅ ይሆንብሻል። አዎ ሴት በመሆንሽ የተሰጠሽ ፀጋ ነውና ተደሰቺ። \n\n'
                          'በሌላ በኩል እስከ 6ኪሎ ክብደትሽ ስለሚጨምርና ሆድሽ ስለሚገፋ ልብሶችሽ እንደድሮ ምቾት አይሰጡሽም። ክብደትሽን መከታተል ቢኖርብሽም ብዙ ሊያስጨንቅሽ ግን አይገባም። ማተኮር ያለብሽ ተመጣጣኝ ምግብ መብላትሽ ላይና በቂ እንቅስቃሴ ማረግሽ ላይ ነው። የምግብ አምሮትሽ እንደጉድ ቢጨምር አይግረምሽ – የምትበይው ለሁለት ሰው መሆኑን አትርሺ። የልጅሽ አይምሮ በደንብ ማደግ የሚጀምርበት ወር ስለሆነም አሳ መብላት ብታዘወትሪ በጣም ጥሩ ነው። ከክብደትሽ ጋር ተያይዞ የወገብና እግር ህመም ይጀምርሽ ይሆናል (ማቅለያ መንገዶችን ተግብሪ)። ነገሮችን መርሳትና እንደድሮ አጣርቶ አለማሰብ በዚህ ወር የተለመደ ነው። ህይወትሽን ለማቅለል እቃዎችን ሁል ጊዜ ተመሳሳይ ቦታ ማስቀመጥና እቅዶችሽን በማስታወሻ መያዝ ይመከራል። ልጅሽ በፍጥነት እያደገ በመሆኑና ሰውነትሽ ለልጅሽ የሚያስፈልጉ ነገሮችን ለማቅረብ ብዙ ስለሚለፋ የደም ግፊትሽ ይቀንሳል። ተያይዞም የማዞር ስሜት ሊኖር ስለሚችል ተቀመጠሽ ወይም ተኝተሽ ስትነሺ ረጋ ብለሽ መሆን አለበት። በምንም መልኩ የመዝለል እንቅስቃሴ ማረግም የለብሽም።\n\n'
                          'ስራ ሰርተሽ ስታርፊ ወይ ተኝተሽ ስትገላበጪ የውጋት ስሜት ሊኖር ይችላል። ይህ የውጋት ስሜት አርፈሽበት ካልተወሽ ወይም እየባሰ ከመጣ ሀኪምሽን አማክሪ። ሆድሽ ላይ ከእንብርትሽ ጀምሮ ወደታች የሚወርድ ጥቁር መስመር ብታይ አትጨነቂ። ሁሉም ነብሰ ጡር ላይ ከ5 እስከ 6 ወር ባለው ጊዜ ውስጥ ይወጣል። በሌላ በኩል ግን ቆዳሽ እየተለጠጠ በመሆኑ የቆዳ መሰንጠቅ ሊያጋጥምሽ ይችላል። ቶሎ ቶሎ ገላን በመታጠብና ሎሽን በመቀባት ማሳከኩን መቀነስ ይቻላል። ስትተኚ በተቻለሽ መጠን በጎን መተኛት ማህጸንሽ የደም ትቦሽ ላይ የሚያደርሰውን ጫና ይቀንሳል። በጎን ስትተኚ ከጀርባሽ፣ ጎንሽ ስር ወይም እግርሽ ስር ትራስ በማረግ ምቾትሽን ጠብቂ። በዚህ ወር የቅድመ ወሊድ ክትትል ቀጠሮ አልትራ ሳውንድ መነሳት ግድ ነው። \n\n'
                          'ይህ የልጅሽን ፆታ ለማወቅ፤ እድገቱ ጤነኛ መሆኑን ለማረጋገጥ፤ የፅንሱንም ሆነ የእንግዴ ልጁን አቀማመጥ ለማየት፤ ስንት ልጅ እንዳረገሽና የወሊድ ቀንሽን በእርግጠኝነት ለማወቅ ይረዳል። ስራ የምትሰሪ ከሆነ ከወለድሽ በኋላ ልጅሽን የሚይዝልሽ ሰው ማፈላለግ ተገቢ ነው። ከወለድሽ በኋላ ልጅሽን ለማታቂው ሰው ከመስጠት አስቀድመሽ ሰው መፈለግና መቅጠር ጠባቂዋን በደንብ እንድታቂያትና እንድትላመዱ ያደርጋል። ብዙ አብሮ መቆየትም የቤተሰብነት ስሜትን እንዲፈጥርና እንደራሷ ልጅ ዕንድትንከባከበው ይረዳል። የህፃናት ማቆያ ለመስጠት ከሆነም ሃሳብሽ ጥሩ የሚባሉትን መጎብኘትና ምርጫሽን ማስተካከል ተገቢ ነው።\n\n'
                          'ስለ ፅንስ\n\n'
                          'ስቅታና ማዛጋት የቀን ተቀን ተግባሩ ነው። ምንም እንኳን አይኑ የተከደነ ቢሆንም ብርሃንን ግን በደንብ ይለያል – ጭለማ ውስጥ ስትሆኚም በደንብ ያቃል። ሆድሽ ላይ መብራት ብታበሪ ወይ ፊቱን ያዞራል ወይ በእጁ ፊቱን ይከልላል። ይህ ብቻ አደለም አሁን ያንቺን ድምፅና የልብ ምትሽን በደንብ ያቀዋል። አባቱ ሆድሽን ቀርቦ የማውራትና ልጁን የማጫወት አመል ካለውም ያባቱን ድምፅ በደንብ ይለያል። አዎ አሁን በደንብ ማዳመጥ ይችላል። ልጆች አብዛኛውን ነገር የሚለምዱት በማህጸን እያሉ በመሆኑ ባለሽ ጊዜ ሁሉ አዋሪው፣ ዝፈኚለት፣ ተረት አውሪለት። ሴት ከሆነች እንቁልጤዋና የዘር ትቦዋ ዝግጁ ሲሆን የውጪኛው የብልት ክፍሏም ማደግ ይጀምራል። ወንድ ከሆነ ደሞ ብልቱ ወደውጪ ያድጋል – ለዛም ነው በአልትራሳውንድ ፆታ መለየት የሚቻለው። እጅና እግሩ በበቂ ሁኔታ አድጎ ከቀረው ሰውነቱ ጋር በመጠን ተስተካክሏል። ቆዳው በውስጥ በኩል በቅባት ይሸፈናል። ይህ በአራስነት ወቅት እራሱን ከብርድ የሚከላከልበት መንገድ ነው። የእንሽርት ውሃውን በተደጋጋሚ በመዋጡ የማጣርያ ስርአቱ በደንብ እንዲሰራ ያደርገዋል። በዚህም የማጣራት ሂደት ከተወለደ በኋላ የሚወጣውን የመጀመርያ ሰገራ ከሚውጠው የእንሽርት ውሃ ውስጥ ያጣራል። ይህ ሰገራ በከለሩ ጥቁርና ዝልግልግ ያለ ነው። አጥንቱ በበቂ ሁኔታ በመጠንከሩ የደም ህዋስ ማምረት ስራውን ከጣፊያ ይረከባል። \n\n'
                          'በወሩ መጨረሻ \n\n'
                          'ከ340 እስከ 350 ግራም ትመዝናለች \n'
                          '27 ሴንቲ ሜተር ትረዝማለች \n'
                          'በአይን ብትታይ ካሮት ታክላለች',
                          style: TextStyle(
                              color: Colors.black,
                              
                              fontFamily: 'Abyssinica SIL',
                              fontSize: 16.0),
                        ),
                      ],
                    ),
                  ),
                ),
              ],
            ),

            ExpansionTile(
              title: Text(
                'የሶስተኛው ወር የእርግዝና ጊዜ ',
                style: TextStyle(
                    color: Colors.purple[600],
                    fontWeight: FontWeight.bold,
                    fontFamily: 'Abyssinica SIL',
                    fontSize: 18.0),
              ),
              children: [
                SingleChildScrollView(
                  child: Padding(
                    padding: EdgeInsets.all(16.0),
                    child: Column(
                      crossAxisAlignment: CrossAxisAlignment.start,
                      children: [
                        Text(
                          'አብዛኛዎቹ ነብሰ ጡሮች ስድስተኛ ወር በደንብ ምቾት ያለው እንደሆነ ይመሰክራሉ። የድካምና የማቅለሽለሽ ስሜቱ አለመኖር ጉልበትን በመስጠት ልጅሽን ስለምታይበት ቀን እንድትጓጊ ያረጋል። የልጅሽን መምጣት አስመልክቶ ግን አንቺ ብቻ ሳትሆኚ ሰውነትሽም ልጅሽ ከማህጸን ውጪ ለሚጠብቀው ህይወት እንዳይበርደው ውፍረቱን እንዲጨምር ያደርጋል። ይህ ማለት አንቺም ክብደትሽ በፍጥነት መጨመር ይጀምራል ማለት ነው – በአበዛኛው 0.5 ኪሎ በሳምንት ትጨምሪያለሽ። ምንም እንኳን ክብደት መጨመርሽ የተፈጥሮ ሂደት ቢሆንም ከሱ ጋር ተያይዞ የሚመጣው የወገብና የእግር ህመም ሊያስቸግርሽ ይችላል። ካልሲየምና ፖታሲየም ያላቸው ምግቦች እንደ ወተትና ሙዝ ለአጥንት ጥሩ በመሆናቸው አዘውትረሽ ተመገቢ። ይሄ ወር ካለቀ በኋላ የሚወለዱ ልጆች ያለጊዜያቸው ቢወለዱም የመኖር እድላቸው ሰፊ በመሆኑ ይህን ወር መጨረስ ማለት ቀላል የምስራች አደለም። ቢሆንም ልጅሽ ማህፀን ውስጥ የምትቆይበት እያንዳንዱ ቀን ለመኖሯ ዋስትና እየሰጠ ስለሚሄድ ሁሌም እራስሽን በደንብ ጠብቂ። ከ 37 ሳምንት በፊት የሚወለዱ ልጆች ያለጊዜያቸው የተወለዱ ህፃናት ሲባሉ እነዚህ እፃናት በአብዛኛው ጊዜ ከሰባተኛ ወር ጀምሮ ስለሚወለዱ ያለጊዜው የሚመጣን የምጥ ምልክት ከአሁን ጀምሮ ማወቅ ተገቢ ነው። ህፃናት ያለጊዜያቸው የሚወለዱት አስገዳጅ ምክንያቶች ካሉና ሃኪም ከወሰነ ወይም ደሞ ያለጊዜው ምጥ ሲጀምር፣ የእንሽርት ውሃ ሲፈስ፣ ወይም ማህፀን ምጥ ሳይኖር መከፈት ከጀመረ ነው። ያለጊዜው መውለድ በሚል እርእስ የተፃፈውን መረጃ በደንብ አንብቢ።\n\n'
                          'ሰውነትሽን በተመለከተ ከሰውነት ውፍረትና ከጡት መጠን መጨመር በተጨማሪ በዚህ ወር የተለያዩ ለውጦች ሊኖሩ ይችላሉ። ወፍራምና አንፀባራቂ ፀጉር፣ ፀጉር በየቦታው ማብቀል፣ ቶሎ ቶሎ ጥፍር ማብቀል፣ የቆዳ መጥቆር፣ የቆዳ መሰነጣጠቅ፣ የጡት ጫፍ መተለቅና መጥቆር እንዲሁም የእግር መጠን መጨመር የተለመዱ የእርግዝና ክስተቶች ናቸው። አትጨነቂ ከውበት በዘለለ ባንቺም በፅንሱም ላይ ምንም ጉዳት አያደርሱም። ፀጉርሽ የሚበዛውና የሚያምረው ብዙ እያበቀልሽ ሳይሆን መነቃቀል ስላቆመ ነው – የእርግዝና ሆርሞኖች የሚሰጡሽ ብቸኛ ጥቅም መሆኑ ነው። ስትወልጂ በፍጥነት በመነቃቀል ስለሚቀንሱ እስካሉ ድረስ አግጪባቸው። \n\n'
                          'ቀለበት የምታደርጊ ከሆነና እጅሽ እየወፈረ ወይም እያበጠ ከሆነ ሳይረፍድ በፊት አውልቂያቸው። ካንቺ እንዲለዩ የማትፈልጊያቸው ቀለበቶች ከሆኑ አንገትሽ ላይ ማንጠልጠል ይመረጣል። የእግር እብጠት ካለ መከላከያ መንገዶችን ተጠቀሚ ግን ከሚገባው በላይ ከሆነ እብጠቱ የፕሪ-እክላምዚአ ምልክት ሊሆን ስለሚችል ህክምና ማግኘት ይኖርብቻል። ከ 24-28 ባለው ሳምንት ውስጥ የስኳርና የቀይ ደም ሴል ብዛትሽ ይለካል። ይህም ምርመራ ችግር ካለ አስቀድሞ ለመቆጣጠር ይረዳል። የስኳር መጠንሽ ከፍተኛ መሆን የልጅሽን መጠን በጣም በመጨመር -በተለይ ከወገብ በላይ – በምጥ መውለድን ሊያከብድብሽ አልፎም በቀዶ ጥገና እንድትገላገዪ ሊያደርግሽ ይችላል። የቀይ ደም ሴል ማነስም የራሱ የሆኑ ችግሮችን ያስከትላል። የእርግዝና ውስብስብ ችግሮች ብለን የዘረዘርናቸውን ማንበብ ይኖርብሻል።\n\n'
                          'ስለ ፅንሱ\n\n'
                          'በዚህ ወር ልጅሽ በጣም ከመንቀሳቀሷ የተነሳ ስትገላበጥና ስትራገጥ ከመሰማት አልፎ ማየት ትችያለሽ። የለመደቻቸውን ሰዎች ድምፅ ስትሰማም እንቅስቃሴ በማረግ መልስ ትመልሳለች። የማዳመጥ አቅሟ በመጨመሩ በጣም የሚጮሁ ድምፆችን ትለምዳቸውና ከተወለደችም በኋላ መስማቱ አያስደነግጣትም። የልብ ምቷም በጣም ስለሚጠነክር ሆዶሽን በደንብ ላዳመጠ ሰው መሰማት ይችላል። ቆዳዋ አሁንም ስስ ሆኖ ወደ ውስጥ ቢያሳይም ከለሯ ግን ቀስ በቀስ መልኩን እየያዘ እየመጣ ነው። አሁን ከሞላ ጎደል ትንሽዬ አራስ ልጅ ብትመስልም ማየት ቢቻል ቆዳዋ በጣም ስስ ከመሆኑ ቀዳዳዎቹን እና ሰውነቷን የሸፈነውን ፀጉር ማየት ይቻላል። የእንሽርት ውሃውን እንደ አየር ወደ ውስጥ ማስገባትና ማስወጣት ትጀምራለች። ይህም ስትወለድ ለምትስበው ለመጀመርያ አየር እንድትዘጋጅ ይረዳታል። \n\n'
                          'በወሩ መጨረሻ \n\n'
                          'ከ 750 እስከ 900 ግራም ትመዝናለች\n \n'
                          '36 ሴንቲ ሜተር ትረዝማለች\n\n'
                          'በአይን ብትታይ ዝኩኒ ታክላለች።',
                          style: TextStyle(
                            fontSize: 16,
                            fontFamily: 'Abyssinica SIL',
                          ),
                        ),
                      ],
                    ),
                  ),
                ),
              ],
            ),

            ExpansionTile(
              title: Text(
                'ማጠቃለያ',
                style: TextStyle(
                    color: Colors.purple[600],
                    fontWeight: FontWeight.bold,
                    fontFamily: 'Abyssinica SIL',
                    fontSize: 18.0),
              ),
              children: [
                SingleChildScrollView(
                  child: Padding(
                    padding: EdgeInsets.all(16.0),
                    child: Column(
                      crossAxisAlignment: CrossAxisAlignment.start,
                      children: [
                        Text(
                          '  ',
                          style: TextStyle(
                            fontSize: 17,
                            fontWeight: FontWeight.bold,
                            fontFamily: 'Abyssinica SIL',
                          ),
                        ),
                        SizedBox(height: 14),
                        Text(
                          'የእርግዝና ሁለተኛ አጋማሽ ብዙ ሴቶች ጉልበት እና ጥሩ ስሜት የሚሰማቸው ጊዜ ነው. በሚታይ ሁኔታ እርጉዝ ትሆኛለሽ፣ ነገር ግን በጣም አትከብጅም እና መዞር አስቸጋሪ ነው። ይህ የልጅሽ ፈጣን እድገት ጊዜ ነው, እና እራሽን በጤንነት ቁጥጥር እና የወሊድ እቅድ ውስጥ  ልታገኝ ትችያለሽ.',
                          style: TextStyle(
                              fontSize: 16, fontFamily: 'Abyssinica SIL'),
                        ),
                        Divider(),
                        CollapsibleSection(
                            title: 'ሁለተኛው ተርሚስተር ምንድነው?',
                            content:
                                'ተርሚስተር ስለ እርግዝና ለማሰብ ጠቃሚ መንገድ ነው ምክንያቱም በእርስዎ እና በልጅዎ ላይ የሚደርሱ ለውጦች በ ሶስት ሰፊ ምድቦች ውስጥ ይወድቃሉ የመጀመሪያ፣ መካከለኛ እና የመጨረሻ ፣ ይህም በመጀመሪያው፣ ሁለተኛ እና ሶስተኛ ተርሚስተር እንደማለት ነው።\nሁለተኛው ተርሚስተር የእርግዝናዎ መካከለኛ ክፍል ማለትም ከሳምንታት 13 እስከ 26 ያለውን ይወክላል። ለብዙ ሴቶች፣ በዚህ ሶስት ወር ውስጥ ካሉት ምርጥ ነገሮች አንዱ የማቅለሽለሽ ስሜት መረጋጋት ሚጀምርበት መሆኑ ነው።'),
                        Divider(),
                        CollapsibleSection(
                            title: ' በሰውነትዎ ምን ይሆናል?',
                            content:
                                'በሁለተኛው ተርሚስተር ሶስት ጊዜ ሰውነትዎ አንዳንድ ዋና ለውጦችን ያደርጋል። ማህፀንዎ ያድጋል፣ እና የማህፀን ጅማቶች ሲዘረጉ አንዳንድ ምቾት ወይም ህመም ሊሰማዎት ይችላል። ቆዳዎ በሆድዎ እና በጡትዎ አካባቢ ሲወጠር ሊሰማዎት ይችላል, ይህም ቀላል ማሳከክን ሊያስከትል ይችላል፡፡አንዳንድ ሴቶች በእነዚህ ቦታዎች ላይ የመለጠጥ ምልክቶች ያጋጥማቸዋል, ይህም ከጊዜ ወደ ጊዜ እየደበዘዘ ይሄዳል.\n ምንም እንኳን የልጅዎ ክብደት ከአንድ ኪሎግራም ያነሰ ቢሆንም, የደምዎ መጠን በውስጥዎ ያለውን እድገትን ሁሉ ለማሟላት ይጨምራል, ይህም ማለት የተወሰነ ተጨማሪ ክብደት ያገኛሉ.'),
                        Divider(),
                        CollapsibleSection(
                          title: 'ምን ይሰማዎታል?',
                          content:
                              'እርግዝና አስደናቂ እና አስደሳች ጊዜ ሊሆን ይችላል, ነገር ግን አንዳንድ ጊዜ አልፎ አልፎ ከፍተኛ ጭንቀት ወይም ዝቅተኛ ስሜት እንዳይሰማን መጠበቅ አስፈላጊ ነው::\nአንዳንድ ጊዜ አንድ ወይም ሁለቱም ወላጆች በእርግዝና ወቅት አስቸጋሪ ስሜቶች ያጋጥማቸዋል, ለምሳሌ፦ ስለ መወለድ መጨነቅ ወይም እንደ ወላጅ መቋቋም አለመቻል፡፡\n የጭንቀት ስሜቶች ብዙም የተለመዱ አይደሉም, እና አንዳንድ ሴቶች የጭንቀት መታወክ ሊያጋጥማቸው ይችላል፡፡ የቅድመ ወሊድ ጭንቀት በእርግዝና ወቅት ሊጠብቁት ከሚችሉት በላይ ከፍተኛ የስሜት ለውጦችን የሚያካትት የስሜት መታወክ ነው።\nስለ ጭንቀት፣ ዝቅተኛ ስሜት ወይም የመንፈስ ጭንቀት ስሜት ከተጨነቁ የሚከተሉትን ማድረግ ይችላሉ፡- ሐኪምዎን ፣ የማህፀን ሐኪምዎን ፣ የሕፃናት ጤና ነርስዎን ወይም አዋላጅዎን ይመልከቱ።',
                        ),
                        Divider(),
                        CollapsibleSection(
                            title: 'ሕፃኑ ምን ይሆናል?',
                            content:
                                'በሁለተኛው ተርሚስተር ሶስት ወራት ውስጥ ልጅዎ ወደ 7.5 ሴ.ሜ, እና በ 13 ኛው ሳምንት 30 ግራም ይመዝናል, በሳምንቱ 26 ወደ 23 ሴሜ እና 820 ግራም ያድጋል፡፡ ልጅዎ በማህፀን ውስጥ ባለው የአሞኒቲክ ከረጢት ውስጥ በነፃነት መንቀሳቀስ ይችላል።\n በ 19 ኛው ሳምንት ገደማ (ወይም ይህ የመጀመሪያ እርግዝናዎ ካልሆነ) ይህ እንቅስቃሴ ሊሰማዎት ይችላል ። \n'
                                'በእነዚህ 3 ወራት ውስጥ የልጅዎ የአካል ክፍሎች ማደግ ይቀጥላሉ እና ጉበት፣ ቆሽት እና ኩላሊት ሁሉም መሰራት ይጀምራሉ። ይህ ጊዜ ደግሞ ህፃናት አውራ ጣትን መምጠጥ የሚጀምሩበት ጊዜ ነው።\n በ 20 ኛው ሳምንት ልጅዎ የልብ ምትዎን ድምጽ ጨምሮ ድምጾችን ይሰማል እና ምንም እንኳን ጆሮዎች ገና ሙሉ በሙሉ ባይፈጠሩም ድምጽዎን መለየት ይማራሉ::\n'),
                        Divider(),
                        CollapsibleSection(
                          title:
                              'በቅድመ ወሊድ ጉብኝትዎ ምን ሊጠብቁ ይችላሉ?',
                          content:
                              'የቅድመ ወሊድ (የእርግዝና) የጤና ምርመራ ከጠቅላላ ሐኪምሽ፣ አዋላጅሽ ወይም ከማህፀን ሐኪም ጋር ሊሆን ይችላል፣ በምትወልጂበየ ቦታ ላይ መሰረት የሚያደርግ ስለሆነ ማተት ነው። በመጀመሪያ የቅድመ ወሊድ የጤና ምርመራ ወቅት እርግዝናሽ በሽንት ወይም በደም ምርመራ ሊረጋገጥ ይችላል። እነዚህ ከቤት የእርግዝና ማረጋገጫ ሙከራዎች የበለጠ አስተማማኝ ናቸው. የመጀመርያ ትሪሜስተር የቅድመ ወሊድ ጤና ምርመራዎች ብዙውን ጊዜ በየ 4 እና 6 ሳምንታት ይከናወናሉ, ነገር ግን ይህ በጤንነትሽ እና በልጅሽ እድገት ላይ በመመስረት ሊለያይ ይችላል. ብዙ ሴቶች በ12 ሳምንታት አካባቢ የአልትራሳውንድ ምርመራ ይደረግላቸዋል - በዚህ ቅኝት የሕፃኑን የልብ ምት ሊሰሙ ይችላሉ። ይህ አልትራሳውንድ በተጨማሪ ብዙ ልደት (ለምሳሌ መንትዮች) እየወለዱ እንደሆነ ያሳያል እና የሕፃኑን መጠን እና የሚደርስበትን ቀን ለመገመትም ይረዳል ።',
                        ),
                        Divider(),
                        CollapsibleSection(
                            title: 'በሁለተኛው ተርሚስተር ሊታሰብባቸው\n'' የሚገቡ ነገሮች:',
                            content:
                                'የወላጅ ፈቃድ - ከባልደረባዎ ጋር ከዚያም ከአሰሪዎ ጋር ይወያዩ፡-\n-የልጅዎን እንክብካቤ ከባልደረባዎ (ወይም ከሌሎች የቤተሰብ አባላት) ጋር እንዴት ይጋራሉ\n-ፈቃድዎን መቼ ለመጀመር አስበዋል?\n-ወደ ሥራ ለመመለስ ሲያስቡ?\n'
                                'የእርግዝና ዜናዎን ከአሰሪዎ ጋር ለመጋራት ጥሩ ጊዜ መቼ ነው?\n'
                                'ልጅዎ ከተወለደ በኋላ በስራ ቦታዎ ውስጥ ሚናዎ ይለወጣል?\n'),
                        Divider(),
                        CollapsibleSection(
                            title: 'ጤናማ ሆነሽ መኖር እንዴት ትችያለሽ?',
                            content:
                                'ጥሩ ምግብ መመገብ እና ንቁ መሆን እንደበፊቱ በእርግዝና ወቅት አስፈላጊ ነው - ለአካላዊ እና ስሜታዊ ጤንነት ጥሩ ነው፣ብሎም ለልጁም ጠቃሚ ነው። በእርግዝና ወቅት ከቀላል እስከ መካከለኛ የአካል ብቃት እንቅስቃሴ ማድረግ አስፈላጊ ነው፡ በሁለተኛው ወር ሶስት ወራት ውስጥ በእግር መሄድን፣ መዋኘትን፣ ዮጋን እና የማይንቀሳቀስ ብስክሌት መንዳትን ያስቡ። ከፍተኛ ተጽዕኖ የሚያሳድር የአካል ብቃት እንቅስቃሴ እና የመውደቅ አደጋ በሚኖርበት ጊዜ እንቅስቃሴዎች በተለይም በሆድ አካባቢ መጎዳት ወይም ከመጠን በላይ ማሞቅ አይመከርም።\nበእርግዝናዎ ወቅት የምግብ ምርጫዎም አስፈላጊ ነው - ይህ ማለት ግን "ለሁለት መብላት" ማለት አይደለም፡፡ በእርግዝናዎ ወቅት የሚበሉት ነገር ልጅዎ እንዴት እንደሚያድግ እና በኋለኛው የህይወቱ ዘመኑ ጤና ላይ ተጽእኖ እንደሚፈጥር ማወቅ ተገቢ ነው፡፡'),
                        Divider(),
                        CollapsibleSection(
                            title: 'የቅድመ ወሊድ ክፍሎች፡-',
                            content:
                                'በአካባቢዎ ስላለው የቅድመ ወሊድ ትምህርት አዋላጅዎን ወይም ዶክተርዎን ይጠይቁ።\nከወሊድ ጓደኛዎ ጋር አብረው ወደ ክፍሎች ለመሄድ ያስቡ - ለጉልበት እንዴት እንደሚዘጋጁ ብዙ መማር ብቻ ሳይሆን ወላጆች የመሆን ልምዳቸውን የሚካፈሉ ሰዎችን ያገኛሉ።'),
                        Divider(),
                        CollapsibleSection(
                            title: 'ከቅድመ ወሊድ ክትትልሽ ምን ይጠበቃል?',
                            content:
                                'መደበኛ የቅድመ ወሊድ ክትትል ጤናን ለመጠበቅ እና ልጅዎ ጤናማ መሆኑን ለማረጋገጥ አስፈላጊ ነው። የጤና ባለሙያዎን ምን ያህል ጊዜ እንሚያዩት እንደ እርስዎ የግል ሁኔታ ይወሰናል፣ ነገር ግን ለብዙ ሴቶች ክትትል በየ 4 እና 6 ሳምንታት ይሆናል።\n በሁለተኛው ወር ሶስት ጊዜ ውስጥ በሚደረጉ ሁሉም ክትትሎች የደም ግፊትዎ ላይ ምርመራ ይደረግልዎታል፣ እጆችዎ እና እግሮችም እንዲሁ ምርመራ ይደረግባቸዋል እብጠት ሊመዘን ይችላል፣ ለምርመራ ደም ተወስዶ ሽንትዎን ይመርምሩ።\n ዶክተርዎ ወይም አዋላጅዎ የልጅዎን እድገት ለመከታተል ሆድዎን ይመረምራሉ እና የልጅዎን የልብ ምት ያዳምጣሉ። በመጀመሪያው ሶስት ወር ውስጥ አልትራሳውንድ ከሌለዎት ከ18 እስከ 20 ሳምንታት አካባቢ ሊነሱ ይችላል።'),

                        // Other Text widgets and content here
                      ],
                    ),
                  ),
                ),
              ],
            ),

            // Add more ExpansionTile widgets for additional sections
          ],
        ),
      ),
    
     bottomNavigationBar: BottomAppBar(
  child: Row(
    mainAxisAlignment: MainAxisAlignment.spaceAround,
    children: [
      SizedBox(
        width: 60, // Adjust width as needed
        child: Column(
          mainAxisSize: MainAxisSize.min,
          children: [
            IconButton(
              icon: Icon(Icons.home),
              onPressed: () {
                // Navigate to the home screen
                Navigator.pushReplacement(
                  context,
                  MaterialPageRoute(builder: (context) => TrimisterPage()),
                );
              },
              tooltip: 'Home',
            ),
            
          ],
        ),
      ),
      SizedBox(
        width: 60, // Adjust width as needed
        child: Column(
          mainAxisSize: MainAxisSize.min,
          children: [
            IconButton(
              icon: Icon(Icons.child_care),
              onPressed: () {
                // Navigate to the infant screen
                Navigator.pushReplacement(
                  context,
                  MaterialPageRoute(builder: (context) => InfantScreen()),
                );
              },
              tooltip: 'Infant',
            ),
            
          ],
        ),
      ),
      SizedBox(
        width: 60, // Adjust width as needed
        child: Column(
          mainAxisSize: MainAxisSize.min,
          children: [
            IconButton(
              icon: Icon(Icons.pregnant_woman),
              onPressed: () {
                // Navigate to the maternal screen
                Navigator.pushReplacement(
                  context,
                  MaterialPageRoute(builder: (context) => DashboardScreen()),
                );
              },
              tooltip: 'Maternal',
            ),
            
          ],
        ),
      ),
    ],
  ),
),
    );
  }
}

class CollapsibleSection extends StatefulWidget {
  final String title;
  final String content;

  CollapsibleSection({required this.title, required this.content});

  @override
  _CollapsibleSectionState createState() => _CollapsibleSectionState();
}

class _CollapsibleSectionState extends State<CollapsibleSection> {
  bool isExpanded = false;

  @override
  Widget build(BuildContext context) {
    return Column(
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
        GestureDetector(
          onTap: () {
            setState(() {
              isExpanded = !isExpanded;
            });
          },
          child: Row(
            mainAxisAlignment: MainAxisAlignment.spaceBetween,
            children: [
              Text(
                widget.title,
                style: TextStyle(
                  fontSize: 16,
                  fontWeight: FontWeight.bold,
                  fontFamily: 'Abyssinica SIL',
                ),
              ),
              Icon(
                isExpanded
                    ? Icons.keyboard_arrow_up
                    : Icons.keyboard_arrow_down,
              ),
            ],
          ),
        ),
        if (isExpanded)
          Padding(
            padding: EdgeInsets.symmetric(vertical: 8.0),
            child: Text(
              widget.content,
              style: TextStyle(fontSize: 16, fontFamily: 'Abyssinica SIL'),
            ),
          ),
      ],
    );
  }
}
